{
  "architectures": [
    "ModernBertForTokenClassification"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 50281,
  "causal_mask": false,
  "classifier_activation": "gelu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "mean",
  "cls_token_id": 50281,
  "decoder_bias": true,
  "deterministic_flash_attn": false,
  "dtype": "float32",
  "embedding_dropout": 0.0,
  "eos_token_id": 50282,
  "global_attn_every_n_layers": 3,
  "global_rope_theta": 160000.0,
  "gradient_checkpointing": false,
  "hidden_activation": "gelu",
  "hidden_size": 512,
  "id2label": {
    "0": "B-account_number",
    "1": "B-age",
    "2": "B-api_key",
    "3": "B-bank_routing_number",
    "4": "B-biometric_identifier",
    "5": "B-blood_type",
    "6": "B-certificate_license_number",
    "7": "B-city",
    "8": "B-company_name",
    "9": "B-coordinate",
    "10": "B-country",
    "11": "B-county",
    "12": "B-credit_debit_card",
    "13": "B-customer_id",
    "14": "B-cvv",
    "15": "B-date",
    "16": "B-date_of_birth",
    "17": "B-date_time",
    "18": "B-device_identifier",
    "19": "B-education_level",
    "20": "B-email",
    "21": "B-employee_id",
    "22": "B-employment_status",
    "23": "B-fax_number",
    "24": "B-first_name",
    "25": "B-gender",
    "26": "B-health_plan_beneficiary_number",
    "27": "B-http_cookie",
    "28": "B-ipv4",
    "29": "B-ipv6",
    "30": "B-language",
    "31": "B-last_name",
    "32": "B-license_plate",
    "33": "B-mac_address",
    "34": "B-medical_record_number",
    "35": "B-national_id",
    "36": "B-occupation",
    "37": "B-password",
    "38": "B-phone_number",
    "39": "B-pin",
    "40": "B-political_view",
    "41": "B-postcode",
    "42": "B-race_ethnicity",
    "43": "B-religious_belief",
    "44": "B-sexuality",
    "45": "B-ssn",
    "46": "B-state",
    "47": "B-street_address",
    "48": "B-swift_bic",
    "49": "B-tax_id",
    "50": "B-time",
    "51": "B-unique_id",
    "52": "B-url",
    "53": "B-user_name",
    "54": "B-vehicle_identifier",
    "55": "I-account_number",
    "56": "I-age",
    "57": "I-api_key",
    "58": "I-bank_routing_number",
    "59": "I-biometric_identifier",
    "60": "I-blood_type",
    "61": "I-certificate_license_number",
    "62": "I-city",
    "63": "I-company_name",
    "64": "I-coordinate",
    "65": "I-country",
    "66": "I-county",
    "67": "I-credit_debit_card",
    "68": "I-customer_id",
    "69": "I-date",
    "70": "I-date_of_birth",
    "71": "I-date_time",
    "72": "I-device_identifier",
    "73": "I-education_level",
    "74": "I-email",
    "75": "I-employment_status",
    "76": "I-fax_number",
    "77": "I-first_name",
    "78": "I-health_plan_beneficiary_number",
    "79": "I-http_cookie",
    "80": "I-ipv4",
    "81": "I-ipv6",
    "82": "I-language",
    "83": "I-last_name",
    "84": "I-license_plate",
    "85": "I-mac_address",
    "86": "I-medical_record_number",
    "87": "I-national_id",
    "88": "I-occupation",
    "89": "I-password",
    "90": "I-phone_number",
    "91": "I-pin",
    "92": "I-political_view",
    "93": "I-postcode",
    "94": "I-race_ethnicity",
    "95": "I-religious_belief",
    "96": "I-sexuality",
    "97": "I-state",
    "98": "I-street_address",
    "99": "I-swift_bic",
    "100": "I-tax_id",
    "101": "I-time",
    "102": "I-unique_id",
    "103": "I-url",
    "104": "I-user_name",
    "105": "I-vehicle_identifier",
    "106": "O"
  },
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 768,
  "is_causal": false,
  "label2id": {
    "B-account_number": 0,
    "B-age": 1,
    "B-api_key": 2,
    "B-bank_routing_number": 3,
    "B-biometric_identifier": 4,
    "B-blood_type": 5,
    "B-certificate_license_number": 6,
    "B-city": 7,
    "B-company_name": 8,
    "B-coordinate": 9,
    "B-country": 10,
    "B-county": 11,
    "B-credit_debit_card": 12,
    "B-customer_id": 13,
    "B-cvv": 14,
    "B-date": 15,
    "B-date_of_birth": 16,
    "B-date_time": 17,
    "B-device_identifier": 18,
    "B-education_level": 19,
    "B-email": 20,
    "B-employee_id": 21,
    "B-employment_status": 22,
    "B-fax_number": 23,
    "B-first_name": 24,
    "B-gender": 25,
    "B-health_plan_beneficiary_number": 26,
    "B-http_cookie": 27,
    "B-ipv4": 28,
    "B-ipv6": 29,
    "B-language": 30,
    "B-last_name": 31,
    "B-license_plate": 32,
    "B-mac_address": 33,
    "B-medical_record_number": 34,
    "B-national_id": 35,
    "B-occupation": 36,
    "B-password": 37,
    "B-phone_number": 38,
    "B-pin": 39,
    "B-political_view": 40,
    "B-postcode": 41,
    "B-race_ethnicity": 42,
    "B-religious_belief": 43,
    "B-sexuality": 44,
    "B-ssn": 45,
    "B-state": 46,
    "B-street_address": 47,
    "B-swift_bic": 48,
    "B-tax_id": 49,
    "B-time": 50,
    "B-unique_id": 51,
    "B-url": 52,
    "B-user_name": 53,
    "B-vehicle_identifier": 54,
    "I-account_number": 55,
    "I-age": 56,
    "I-api_key": 57,
    "I-bank_routing_number": 58,
    "I-biometric_identifier": 59,
    "I-blood_type": 60,
    "I-certificate_license_number": 61,
    "I-city": 62,
    "I-company_name": 63,
    "I-coordinate": 64,
    "I-country": 65,
    "I-county": 66,
    "I-credit_debit_card": 67,
    "I-customer_id": 68,
    "I-date": 69,
    "I-date_of_birth": 70,
    "I-date_time": 71,
    "I-device_identifier": 72,
    "I-education_level": 73,
    "I-email": 74,
    "I-employment_status": 75,
    "I-fax_number": 76,
    "I-first_name": 77,
    "I-health_plan_beneficiary_number": 78,
    "I-http_cookie": 79,
    "I-ipv4": 80,
    "I-ipv6": 81,
    "I-language": 82,
    "I-last_name": 83,
    "I-license_plate": 84,
    "I-mac_address": 85,
    "I-medical_record_number": 86,
    "I-national_id": 87,
    "I-occupation": 88,
    "I-password": 89,
    "I-phone_number": 90,
    "I-pin": 91,
    "I-political_view": 92,
    "I-postcode": 93,
    "I-race_ethnicity": 94,
    "I-religious_belief": 95,
    "I-sexuality": 96,
    "I-state": 97,
    "I-street_address": 98,
    "I-swift_bic": 99,
    "I-tax_id": 100,
    "I-time": 101,
    "I-unique_id": 102,
    "I-url": 103,
    "I-user_name": 104,
    "I-vehicle_identifier": 105,
    "O": 106
  },
  "layer_norm_eps": 1e-05,
  "layer_types": [
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention"
  ],
  "local_attention": 128,
  "local_rope_theta": 10000.0,
  "max_position_embeddings": 7999,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 8,
  "num_hidden_layers": 19,
  "pad_token_id": 50283,
  "position_embedding_type": "sans_pos",
  "repad_logits_with_grad": false,
  "rope_parameters": {
    "full_attention": {
      "rope_theta": 160000.0,
      "rope_type": "default"
    },
    "sliding_attention": {
      "rope_theta": 160000.0,
      "rope_type": "default"
    }
  },
  "sep_token_id": 50282,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": false,
  "transformers_version": "4.57.6",
  "vocab_size": 50368
}
